#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```terraform

module.eks.module.eks_blueprints_addons.random_bytes.this: Refreshing state...
module.vpc.data.aws_availability_zones.azs: Reading...
module.eks.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0a8b8edc802ae047b]
module.eks.aws_iam_role.external-admin: Refreshing state... [id=external-admin]
module.iam_role.aws_iam_role.app-server-role: Refreshing state... [id=app-server-role-tf]
data.aws_caller_identity.current: Reading...
module.eks.module.eks.module.eks_managed_node_group["initial"].data.aws_partition.current: Reading...
module.eks.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.data.aws_caller_identity.current[0]: Reading...
aws_key_pair.ssh-key: Refreshing state... [id=devsecops-cicd-server-key]
module.eks.module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.ec2["6-cd-pipeline"].data.aws_ami.image: Reading...
module.eks.module.eks.module.eks_managed_node_group["initial"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.data.aws_partition.current[0]: Reading...
module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.module.eks_blueprints_addons.data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=326347646211]
module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.data.aws_partition.current[0]: Reading...
module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.module.eks_blueprints_addons.data.aws_region.current: Reading...
module.eks.module.eks_blueprints_addons.data.aws_region.current: Read complete after 0s [id=us-east-2]
module.eks.aws_iam_role.external-developer: Refreshing state... [id=external-developer]
module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.data.aws_caller_identity.current[0]: Read complete after 0s [id=326347646211]
module.eks.module.eks.data.aws_partition.current: Reading...
module.eks.module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.data.aws_caller_identity.current[0]: Reading...
module.eks.module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=326347646211]
module.eks.module.eks_blueprints_addons.data.aws_partition.current: Reading...
module.eks.module.eks_blueprints_addons.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks.module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.ec2["6-cd-pipeline"].data.aws_availability_zones.available: Reading...
module.eks.module.eks_blueprints_addons.data.aws_caller_identity.current: Read complete after 0s [id=326347646211]
module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.data.aws_caller_identity.current[0]: Read complete after 0s [id=326347646211]
module.eks.module.eks.data.aws_caller_identity.current: Reading...
module.eks.module.eks.module.eks_managed_node_group["initial"].data.aws_caller_identity.current: Reading...
module.eks.module.eks.module.eks_managed_node_group["initial"].data.aws_caller_identity.current: Read complete after 0s [id=326347646211]
module.eks.module.eks.data.aws_caller_identity.current: Read complete after 0s [id=326347646211]
module.eks.module.eks.module.eks_managed_node_group["initial"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks.module.eks_managed_node_group["initial"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/devsecops-cicd-cluster/cluster]
module.eks.module.eks.aws_iam_role.this[0]: Refreshing state... [id=devsecops-cicd-cluster-cluster-20250119161223774300000001]
module.eks.module.eks.data.aws_iam_session_context.current: Reading...
module.vpc.data.aws_availability_zones.azs: Read complete after 0s [id=us-east-2]
module.eks.module.eks.module.eks_managed_node_group["initial"].aws_iam_role.this[0]: Refreshing state... [id=initial-eks-node-group-20250119161223775800000002]
module.iam_role.aws_iam_instance_profile.app-server-role: Refreshing state... [id=app-server-role-tf]
module.eks.module.eks_blueprints_addons.data.aws_iam_policy_document.aws_load_balancer_controller[0]: Reading...
module.eks.module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:sts::326347646211:assumed-role/devsecops-bootcamp-openid-gh-action/terraform-cidi-session]
module.eks.module.eks_blueprints_addons.data.aws_iam_policy_document.aws_load_balancer_controller[0]: Read complete after 0s [id=2641054984]
module.ec2["6-cd-pipeline"].data.aws_availability_zones.available: Read complete after 0s [id=us-east-2]
module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2641054984]
module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.aws_iam_policy.this[0]: Refreshing state... [id=arn:aws:iam::326347646211:policy/alb-controller-20250119161223779100000003]
module.eks.module.eks.module.eks_managed_node_group["initial"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=initial-eks-node-group-20250119161223775800000002-20250119161224581100000004]
module.eks.module.eks.module.eks_managed_node_group["initial"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=initial-eks-node-group-20250119161223775800000002-20250119161224632200000005]
module.eks.module.eks.module.eks_managed_node_group["initial"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=initial-eks-node-group-20250119161223775800000002-20250119161224657500000006]
module.eks.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=devsecops-cicd-cluster-cluster-20250119161223774300000001-20250119161224857500000007]
module.eks.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=devsecops-cicd-cluster-cluster-20250119161223774300000001-20250119161224857900000008]
module.eks.module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3853864722]
module.eks.module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=f958278f-7f09-447e-9270-1bda5141127f]
module.ec2["6-cd-pipeline"].data.aws_ami.image: Read complete after 1s [id=ami-0862be96e41dcbf74]
module.eks.module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/devsecops-cicd-cluster]
module.eks.module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::326347646211:policy/devsecops-cicd-cluster-cluster-ClusterEncryption2025011916124659110000000d]
module.eks.module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=devsecops-cicd-cluster-cluster-20250119161223774300000001-2025011916124709080000000e]
module.vpc.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-00bb34a9314c32cad]
module.vpc.data.aws_subnets.private_subnets: Reading...
module.vpc.data.aws_subnets.public_subnets: Reading...
module.vpc.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0cca9ef6b9240e8cb]
module.vpc.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-00bbfeeb3f6384bb3]
module.vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0a74479fa4b6fa007]
module.vpc.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0f55132a43a1047ce]
module.vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-003cdf95ca7d0f81e]
module.vpc.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0a58c01160880dc2b]
module.vpc.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0b8da0a67e483e938]
module.vpc.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0bd440b6d174e6f9b]
module.vpc.data.aws_subnets.private_subnets: Read complete after 0s [id=us-east-2]
module.vpc.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0938d42f8327a23f9]
module.vpc.data.aws_subnets.public_subnets: Read complete after 0s [id=us-east-2]
module.vpc.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-07bf1c81309e24d5c]
aws_default_security_group.default-sg: Refreshing state... [id=sg-00bbfeeb3f6384bb3]
module.vpc.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0663c598c63f582c9]
module.vpc.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0cca9ef6b9240e8cb1080289494]
module.vpc.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0f358a4dfa8521bc2]
module.vpc.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0f513e8e3d3a2e3d1]
module.vpc.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-033c0a6dc02ef5c6d]
module.vpc.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0734e3c8e37ec5862]
module.ec2["6-cd-pipeline"].aws_instance.app: Refreshing state... [id=i-0ce3a45f07f3dfa3a]
module.eks.module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=devsecops-cicd-cluster]
module.vpc.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-09d82107ae43986ba]
module.vpc.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0336cf3c02699a021]
module.vpc.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0928b68a48ff69aea]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-07c008a690881b4a6]
module.vpc.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0663c598c63f582c91080289494]
module.eks.module.eks.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=devsecops-cicd-cluster:arn:aws:iam::326347646211:role/devsecops-bootcamp-openid-gh-action]
module.eks.module.eks.data.tls_certificate.this[0]: Reading...
module.eks.module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
module.eks.module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...
module.eks.module.eks.data.aws_eks_addon_version.this["coredns"]: Reading...
module.eks.module.eks.time_sleep.this[0]: Refreshing state... [id=2025-01-19T16:20:51Z]
module.eks.module.eks.module.eks_managed_node_group["initial"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=1156220981773149937]
module.eks.module.eks.module.eks_managed_node_group["initial"].aws_launch_template.this[0]: Refreshing state... [id=lt-08411913b9b364631]
module.eks.module.eks.data.tls_certificate.this[0]: Read complete after 0s [id=41c9ad86376859231a2244535dff0f089ba892cb]
module.eks.module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::326347646211:oidc-provider/oidc.eks.us-east-2.amazonaws.com/id/ED6264D4CD82F5957CB3006F250BE4C4]
module.eks.module.eks.module.eks_managed_node_group["initial"].aws_eks_node_group.this[0]: Refreshing state... [id=devsecops-cicd-cluster:initial-20250119162052246400000013]
module.eks.module.eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns]
module.eks.module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 0s [id=kube-proxy]
module.eks.module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=devsecops-cicd-cluster#arn:aws:iam::326347646211:role/devsecops-bootcamp-openid-gh-action#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks.module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni]
module.eks.module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=devsecops-cicd-cluster:coredns]
module.eks.module.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=devsecops-cicd-cluster:kube-proxy]
module.eks.module.eks.aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=devsecops-cicd-cluster:vpc-cni]
module.eks.module.eks_blueprints_addons.data.aws_iam_policy_document.cluster_autoscaler[0]: Reading...
module.eks.module.eks_blueprints_addons.data.aws_iam_policy_document.cluster_autoscaler[0]: Read complete after 0s [id=3081274222]
module.eks.module.eks_blueprints_addons.time_sleep.this: Refreshing state... [id=2025-01-19T16:20:52Z]
module.eks.module.eks_blueprints_addons.aws_cloudformation_stack.usage_telemetry[0]: Refreshing state... [id=arn:aws:cloudformation:us-east-2:326347646211:stack/devsecops-cicd-cluster-07e4/489d7a60-d681-11ef-91df-029bf4bb6101]
module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.data.aws_iam_policy_document.this[0]: Reading...
module.eks.kubernetes_cluster_role.cluster_viewer: Refreshing state... [id=cluster-viewer]
module.eks.kubernetes_cluster_role_binding.cluster_viewer: Refreshing state... [id=cluster-viewer]
module.eks.kubernetes_namespace.online-boutique: Refreshing state... [id=online-boutique]
module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3081274222]
module.eks.kubernetes_role.namespace-viewer: Refreshing state... [id=online-boutique/namespace-viewer]
module.eks.kubernetes_role_binding.namespace-viewer: Refreshing state... [id=online-boutique/namespace-viewer]
module.eks.module.eks_aws_auth.kubernetes_config_map_v1_data.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.eks.module.eks_blueprints_addons.module.metrics_server.helm_release.this[0]: Refreshing state... [id=metrics-server]
module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.data.aws_iam_policy_document.assume[0]: Reading...
module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.data.aws_iam_policy_document.assume[0]: Read complete after 0s [id=2179765366]
module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.aws_iam_policy.this[0]: Refreshing state... [id=arn:aws:iam::326347646211:policy/cluster-autoscaler-2025011916202264170000000f]
module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.data.aws_iam_policy_document.assume[0]: Reading...
module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.data.aws_iam_policy_document.assume[0]: Read complete after 0s [id=376229968]
module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.aws_iam_role.this[0]: Refreshing state... [id=alb-controller-20250119162052654500000015]
module.eks.helm_release.argocd: Refreshing state... [id=argocd]
module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.aws_iam_role.this[0]: Refreshing state... [id=cluster-autoscaler-20250119162052654700000016]
module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.aws_iam_role_policy_attachment.this[0]: Refreshing state... [id=cluster-autoscaler-20250119162052654700000016-20250119162053480600000018]
module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.helm_release.this[0]: Refreshing state... [id=cluster-autoscaler]
module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.aws_iam_role_policy_attachment.this[0]: Refreshing state... [id=alb-controller-20250119162052654500000015-20250119162053334500000017]
module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.helm_release.this[0]: Refreshing state... [id=aws-load-balancer-controller]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.iam_role.aws_iam_role.app-server-role has changed
  ~ resource "aws_iam_role" "app-server-role" {
        id                    = "app-server-role-tf"
        name                  = "app-server-role-tf"
      + tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # module.eks.module.eks.module.eks_managed_node_group["initial"].aws_eks_node_group.this[0] has changed
  ~ resource "aws_eks_node_group" "this" {
        id                     = "devsecops-cicd-cluster:initial-20250119162052246400000013"
      + labels                 = {}
        tags                   = {
            "Name" = "initial"
        }
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # aws_default_security_group.default-sg will be updated in-place
  ~ resource "aws_default_security_group" "default-sg" {
        id                     = "sg-00bbfeeb3f6384bb3"
        name                   = "default"
      ~ tags                   = {
          - "Name"                                = "devsecops-cicd-default" -> null
          - "kubernets.io/cluster/devsecops-cicd" = "shared" -> null
          - "terraform"                           = "true" -> null
        }
      ~ tags_all               = {
          - "Name"                                = "devsecops-cicd-default" -> null
          - "kubernets.io/cluster/devsecops-cicd" = "shared" -> null
          - "terraform"                           = "true" -> null
            # (4 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.eks.data.aws_eks_cluster.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster" "this" {
      + access_config             = (known after apply)
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = "devsecops-cicd-cluster"
      + outpost_config            = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # module.eks.data.aws_eks_cluster_auth.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster_auth" "this" {
      + id    = (known after apply)
      + name  = "devsecops-cicd-cluster"
      + token = (sensitive value)
    }

  # module.vpc.module.vpc.aws_default_network_acl.this[0] will be updated in-place
  ~ resource "aws_default_network_acl" "this" {
        id                     = "acl-0f55132a43a1047ce"
      ~ tags                   = {
            "Name"                                         = "devsecops-cicd-default"
          + "kubernetes.io/cluster/devsecops-cicd-cluster" = "shared"
          - "kubernets.io/cluster/devsecops-cicd"          = "shared" -> null
            "terraform"                                    = "true"
        }
      ~ tags_all               = {
          + "kubernetes.io/cluster/devsecops-cicd-cluster" = "shared"
          - "kubernets.io/cluster/devsecops-cicd"          = "shared" -> null
            # (6 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.vpc.module.vpc.aws_default_route_table.default[0] will be updated in-place
  ~ resource "aws_default_route_table" "default" {
        id                     = "rtb-00bb34a9314c32cad"
      ~ tags                   = {
            "Name"                                         = "devsecops-cicd-default"
          + "kubernetes.io/cluster/devsecops-cicd-cluster" = "shared"
          - "kubernets.io/cluster/devsecops-cicd"          = "shared" -> null
            "terraform"                                    = "true"
        }
      ~ tags_all               = {
          + "kubernetes.io/cluster/devsecops-cicd-cluster" = "shared"
          - "kubernets.io/cluster/devsecops-cicd"          = "shared" -> null
            # (6 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.module.vpc.aws_default_security_group.this[0] will be updated in-place
  ~ resource "aws_default_security_group" "this" {
        id                     = "sg-00bbfeeb3f6384bb3"
        name                   = "default"
      ~ tags                   = {
            "Name"                                         = "devsecops-cicd-default"
          + "kubernetes.io/cluster/devsecops-cicd-cluster" = "shared"
          - "kubernets.io/cluster/devsecops-cicd"          = "shared" -> null
            "terraform"                                    = "true"
        }
      ~ tags_all               = {
          + "kubernetes.io/cluster/devsecops-cicd-cluster" = "shared"
          - "kubernets.io/cluster/devsecops-cicd"          = "shared" -> null
            # (6 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_eip.nat[0] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-0f358a4dfa8521bc2"
      ~ tags                 = {
            "Name"                                         = "devsecops-cicd-us-east-2a"
          + "kubernetes.io/cluster/devsecops-cicd-cluster" = "shared"
          - "kubernets.io/cluster/devsecops-cicd"          = "shared" -> null
            "terraform"                                    = "true"
        }
      ~ tags_all             = {
          + "kubernetes.io/cluster/devsecops-cicd-cluster" = "shared"
          - "kubernets.io/cluster/devsecops-cicd"          = "shared" -> null
            # (6 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-0a74479fa4b6fa007"
      ~ tags     = {
            "Name"                                         = "devsecops-cicd"
          + "kubernetes.io/cluster/devsecops-cicd-cluster" = "shared"
          - "kubernets.io/cluster/devsecops-cicd"          = "shared" -> null
            "terraform"                                    = "true"
        }
      ~ tags_all = {
          + "kubernetes.io/cluster/devsecops-cicd-cluster" = "shared"
          - "kubernets.io/cluster/devsecops-cicd"          = "shared" -> null
            # (6 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_nat_gateway.this[0] will be updated in-place
  ~ resource "aws_nat_gateway" "this" {
        id                                 = "nat-07c008a690881b4a6"
      ~ tags                               = {
            "Name"                                         = "devsecops-cicd-us-east-2a"
          + "kubernetes.io/cluster/devsecops-cicd-cluster" = "shared"
          - "kubernets.io/cluster/devsecops-cicd"          = "shared" -> null
            "terraform"                                    = "true"
        }
      ~ tags_all                           = {
          + "kubernetes.io/cluster/devsecops-cicd-cluster" = "shared"
          - "kubernets.io/cluster/devsecops-cicd"          = "shared" -> null
            # (6 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0663c598c63f582c9"
      ~ tags             = {
            "Name"                                         = "devsecops-cicd-private"
          + "kubernetes.io/cluster/devsecops-cicd-cluster" = "shared"
          - "kubernets.io/cluster/devsecops-cicd"          = "shared" -> null
            "terraform"                                    = "true"
        }
      ~ tags_all         = {
          + "kubernetes.io/cluster/devsecops-cicd-cluster" = "shared"
          - "kubernets.io/cluster/devsecops-cicd"          = "shared" -> null
            # (6 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0cca9ef6b9240e8cb"
      ~ tags             = {
            "Name"                                         = "devsecops-cicd-public"
          + "kubernetes.io/cluster/devsecops-cicd-cluster" = "shared"
          - "kubernets.io/cluster/devsecops-cicd"          = "shared" -> null
            "terraform"                                    = "true"
        }
      ~ tags_all         = {
          + "kubernetes.io/cluster/devsecops-cicd-cluster" = "shared"
          - "kubernets.io/cluster/devsecops-cicd"          = "shared" -> null
            # (6 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_subnet.private[0] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0938d42f8327a23f9"
      ~ tags                                           = {
            "Name"                                         = "devsecops-cicd-private-us-east-2a"
          + "kubernetes.io/cluster/devsecops-cicd-cluster" = "shared"
          + "kubernetes.io/role/internal-elb"              = "1"
          - "kubernets.io/cluster/devsecops-cicd"          = "shared" -> null
          - "kubernets.io/role/internal-elb"               = "1" -> null
            "terraform"                                    = "true"
        }
      ~ tags_all                                       = {
          + "kubernetes.io/cluster/devsecops-cicd-cluster" = "shared"
          + "kubernetes.io/role/internal-elb"              = "1"
          - "kubernets.io/cluster/devsecops-cicd"          = "shared" -> null
          - "kubernets.io/role/internal-elb"               = "1" -> null
            # (6 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_subnet.private[1] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-07bf1c81309e24d5c"
      ~ tags                                           = {
            "Name"                                         = "devsecops-cicd-private-us-east-2b"
          + "kubernetes.io/cluster/devsecops-cicd-cluster" = "shared"
          + "kubernetes.io/role/internal-elb"              = "1"
          - "kubernets.io/cluster/devsecops-cicd"          = "shared" -> null
          - "kubernets.io/role/internal-elb"               = "1" -> null
            "terraform"                                    = "true"
        }
      ~ tags_all                                       = {
          + "kubernetes.io/cluster/devsecops-cicd-cluster" = "shared"
          + "kubernetes.io/role/internal-elb"              = "1"
          - "kubernets.io/cluster/devsecops-cicd"          = "shared" -> null
          - "kubernets.io/role/internal-elb"               = "1" -> null
            # (6 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_subnet.private[2] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0bd440b6d174e6f9b"
      ~ tags                                           = {
            "Name"                                         = "devsecops-cicd-private-us-east-2c"
          + "kubernetes.io/cluster/devsecops-cicd-cluster" = "shared"
          + "kubernetes.io/role/internal-elb"              = "1"
          - "kubernets.io/cluster/devsecops-cicd"          = "shared" -> null
          - "kubernets.io/role/internal-elb"               = "1" -> null
            "terraform"                                    = "true"
        }
      ~ tags_all                                       = {
          + "kubernetes.io/cluster/devsecops-cicd-cluster" = "shared"
          + "kubernetes.io/role/internal-elb"              = "1"
          - "kubernets.io/cluster/devsecops-cicd"          = "shared" -> null
          - "kubernets.io/role/internal-elb"               = "1" -> null
            # (6 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-003cdf95ca7d0f81e"
      ~ tags                                           = {
            "Name"                                         = "devsecops-cicd-public-us-east-2a"
          + "kubernetes.io/cluster/devsecops-cicd-cluster" = "shared"
          + "kubernetes.io/role/elb"                       = "1"
          - "kubernets.io/cluster/devsecops-cicd"          = "shared" -> null
          - "kubernets.io/role/elb"                        = "1" -> null
            "terraform"                                    = "true"
        }
      ~ tags_all                                       = {
          + "kubernetes.io/cluster/devsecops-cicd-cluster" = "shared"
          + "kubernetes.io/role/elb"                       = "1"
          - "kubernets.io/cluster/devsecops-cicd"          = "shared" -> null
          - "kubernets.io/role/elb"                        = "1" -> null
            # (6 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_subnet.public[1] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0b8da0a67e483e938"
      ~ tags                                           = {
            "Name"                                         = "devsecops-cicd-public-us-east-2b"
          + "kubernetes.io/cluster/devsecops-cicd-cluster" = "shared"
          + "kubernetes.io/role/elb"                       = "1"
          - "kubernets.io/cluster/devsecops-cicd"          = "shared" -> null
          - "kubernets.io/role/elb"                        = "1" -> null
            "terraform"                                    = "true"
        }
      ~ tags_all                                       = {
          + "kubernetes.io/cluster/devsecops-cicd-cluster" = "shared"
          + "kubernetes.io/role/elb"                       = "1"
          - "kubernets.io/cluster/devsecops-cicd"          = "shared" -> null
          - "kubernets.io/role/elb"                        = "1" -> null
            # (6 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_subnet.public[2] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0a58c01160880dc2b"
      ~ tags                                           = {
            "Name"                                         = "devsecops-cicd-public-us-east-2c"
          + "kubernetes.io/cluster/devsecops-cicd-cluster" = "shared"
          + "kubernetes.io/role/elb"                       = "1"
          - "kubernets.io/cluster/devsecops-cicd"          = "shared" -> null
          - "kubernets.io/role/elb"                        = "1" -> null
            "terraform"                                    = "true"
        }
      ~ tags_all                                       = {
          + "kubernetes.io/cluster/devsecops-cicd-cluster" = "shared"
          + "kubernetes.io/role/elb"                       = "1"
          - "kubernets.io/cluster/devsecops-cicd"          = "shared" -> null
          - "kubernets.io/role/elb"                        = "1" -> null
            # (6 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                                   = "vpc-0a8b8edc802ae047b"
      ~ tags                                 = {
            "Name"                                         = "devsecops-cicd"
          + "kubernetes.io/cluster/devsecops-cicd-cluster" = "shared"
          - "kubernets.io/cluster/devsecops-cicd"          = "shared" -> null
            "terraform"                                    = "true"
        }
      ~ tags_all                             = {
          + "kubernetes.io/cluster/devsecops-cicd-cluster" = "shared"
          - "kubernets.io/cluster/devsecops-cicd"          = "shared" -> null
            # (6 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

Plan: 0 to add, 16 to change, 0 to destroy.

```

</details>

*Pushed by: @tonyrud, Action: `pull_request`*